#### Q1. List any five functions of the pandas library with execution.

In [10]:
import pandas as pd 
df=pd.read_csv(r"C:\Users\Rahul\Downloads\titanic.csv")

In [7]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [9]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [11]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

#### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
#### DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [13]:
def reindex_with_increment(df):
    
    new_index = pd.RangeIndex(start=1, stop=len(df) * 2, step=2)
    df_reindexed = df.reset_index(drop=True)
    df_reindexed.index = new_index
    
    return df_reindexed

### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
### iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
### function should print the sum to the console.

In [36]:
def sam(df):
    
    m=val['Values'].iloc[0:4]
    return m.sum()

In [37]:
sam(df)

10

#### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
#### 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [ ]:
def cre():
    df['Word_Count']=len(df['Text'])

### Q5. How are DataFrame.size() and DataFrame.shape() different?

### DataFrame.size() returns the total number of elements (rows * columns) in the DataFrame, whereas DataFrame.shape() returns a tuple containing the number of rows and the number of columns, providing the actual dimensions of the DataFrame.

### Q6. Which function of pandas do we use to read an excel file?

### We use read_csv function

#### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
##### addresses in the format 'username@domain.com'. Write a Python function that creates a new column
##### 'Username' in df that contains only the username part of each email address.

In [ ]:
import pandas as pd

def extract(df):
    df['Username'] = df['Email'].str.split('@').str[0]
    return df

#### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
#### all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
#### function should return a new DataFrame that contains only the selected rows.

In [27]:
def new_col(df):
    
    s_rows= df[(df['a']>5) & (df['B']<10)]
    return s_rows

#### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,median, and standard deviation of the values in the 'Values' column.

In [31]:
def cal(df):
    return df['Values'].describe()

### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function tocreate a new column 'MovingAverage' that contains the moving average of the sales for the past 7 daysfor each row in the DataFrame. The moving average should be calculated using a window of size 7 andshould include the current day.

In [55]:
def MovingAverage(df):
    Moving_Average=df['Sales'].rolling(window=7, min_periods=1).mean()
    return Moving_Average

### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a newcolumn 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.Monday, Tuesday) corresponding to each date in the 'Date' column.

In [58]:
def get_weekday(df):
    df['weekday']=df['newDate'].dt.strftime('%A')
    return df

### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Pythonfunction to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [67]:
def select(df):
    dates=df[(df['Date']>= '2023-01-01')&(df['Date']<='2023-01-31')]
    return dates

### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs tobe imported?

### Pandas library need to be imported